### Block Release Exercise: Preprocessing Group

This notebook is for the pre-processing group. Your aim is to take the data contained in *customerlist.xlsx*, clean it up, and make it consistent with the interface format so that your data can be passed onto the other group at the end of the afternoon session. You should not communicate with the other group until the end of the task.

There are various tasks that you have to do. These are marked with "Coding Task" in the sheet.

You will need to start by downloading the initial version of the spreadsheet *customerList.xlsx* from the GitHub site; we will give your team a name and associated GitHub project. Check out a copy of this from GitHub, and make sure that you have it in the same folder as this notebook.

##### Background Information: Customer Spreadsheet

The customer spreadsheet provided is for customers of an online coffee company. It has five columns: Customer Name, Address, Email, Total Orders, and Order Type. Customer total orders are either recorded by "Individual" number of coffee pods ordered, or by "Packets" that consist of 12 coffee pods.

##### Background Information: Interface Format

The software interface between your work and the work by the other group consists of an csv formatted file, i.e. a file where on each row, entries are separated by commas, with a newline separating rows.The columns are: First Name, Last Name, Email, Address, Total Orders (in that order). Total orders is in terms of individual numbers of pods. So, the output from running this notebook will need to be in that format. The file should be called *cleanedCustomerData.csv*

Coding Task: in the next block, import the Pandas data processing library and name it "pd"

In [78]:
import pandas as pd

Coding Task: in the next block, read in the file "customers.xlsx" into a Pandas dataframe called customers, then print it out to make sure that you have read it in correctly.

In [119]:
customer_data = pd.read_excel("customers.xlsx")
customer_data

,Customer Name,Address,Email,Total Orders,Order Type
0,Jaswinder Singh,"37 Broadwide Road, Rummidge, RU6 7HG",JasSingh78@example.com,57,Individual
1,Mark Harper,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,5,Packets
2,Melinda Nagy,"77 Melton Road, Somecity, SM12 1HE",MelN@example.com,152,Ind.
3,Yichen Zhang,"6/1 Braeside Court, Scotstoun, SC5 1HE",YZ41234253@example.com,17,Packets
4,Mark Harper,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,5,Packets
5,Rebecca Jameson,"The Old Rectory, Humbleside, Marksham, MA14 6LW",BeckyJamzie@example.com,271,Individual
6,Willem deVries,"17 Parkside, Newtown-le-Willows, NL18 5TH",deVries1955@example.com,23,Packets
7,Jaswinder Singh,"37 Broadwide Road, Rummidge, South Midlands, R...",JasSingh78@example.com,72,Individual
8,James Colton,"19 Belton Street, Isle of Trees, IT2 5PQ",JimmyColton@example.com,6,Packets
9,Ethel Trellis,"1 The Avenue, Foxley Estate, Rummidge, RU4 7WF",EthelsPlace@example.com,2,Packets

The next few tasks are concerned with cleaning the data. Before you look at the step-to-step guidelines below, look at the data and decide where there are inconsistencies, duplicates, problems. Look at the output format and consider how the desired output format differs from the input format. Make some notes on this in the next block.

In [120]:
# Checking Data Types
for col in customer_data.columns:
    for i,c in enumerate(customer_data[col]):
        print(str(c) + " " + str(type(c)))

Jaswinder Singh <class 'str'>
Mark Harper <class 'str'>
Melinda Nagy <class 'str'>
Yichen Zhang <class 'str'>
Mark Harper <class 'str'>
Rebecca Jameson <class 'str'>
Willem deVries <class 'str'>
Jaswinder Singh <class 'str'>
James Colton <class 'str'>
Ethel Trellis <class 'str'>
37 Broadwide Road, Rummidge, RU6 7HG <class 'str'>
Flat 5, Riverside House, Anytown, AN2 8NE <class 'str'>
77 Melton Road, Somecity, SM12 1HE <class 'str'>
6/1 Braeside Court, Scotstoun, SC5 1HE <class 'str'>
Flat 5, Riverside House, Anytown, AN2 8NE <class 'str'>
The Old Rectory, Humbleside, Marksham, MA14 6LW <class 'str'>
17 Parkside, Newtown-le-Willows, NL18 5TH <class 'str'>
37 Broadwide Road, Rummidge, South Midlands, RU6 7HG <class 'str'>
19 Belton Street, Isle of Trees, IT2 5PQ <class 'str'>
1 The Avenue, Foxley Estate, Rummidge, RU4 7WF <class 'str'>
JasSingh78@example.com <class 'str'>
Mark.Harper@example.com <class 'str'>
MelN@example.com <class 'str'>
YZ41234253@example.com <class 'str'>
Mark.Harper@example.com <class 'str'>
BeckyJamzie@example.com <class 'str'>
deVries1955@example.com <class 'str'>
JasSingh78@example.com <class 'str'>
JimmyColton@example.com <class 'str'>
EthelsPlace@example.com <class 'str'>
57 <class 'int'>
5 <class 'int'>
152 <class 'int'>
17 <class 'int'>
5 <class 'int'>
271 <class 'int'>
23 <class 'int'>
72 <class 'int'>
6 <class 'int'>
2 <class 'int'>
Individual <class 'str'>
Packets <class 'str'>
Ind. <class 'str'>
Packets <class 'str'>
Packets <class 'str'>
Individual <class 'str'>
Packets <class 'str'>
Individual <class 'str'>
Packets <class 'str'>
Packets <class 'str'>

Replace "Ind." with "Individual"
Where there are duplicate names, sum the total orders
Change data types where necessary

Preliminary Example: In a lot of the code you are going to write below, you will need to loop through one or more columns of the DataFrame to look for particular patterns and make changes. The basic idea you will use a lot is a for loop with an *enumerate* function, which loops through each row of the dataframe and gives names to the current row and the item of interest, and the *at* function that takes a column name and row number and allows you to view or change that data point.

In [121]:
#example
for i,c in enumerate(customer_data["Email"]):
    print(c)
    #customers.at[i,"Email"] = "blah" # showing how to make a change
    # don't uncomment the previous line or you will over-write all the email addresses!

JasSingh78@example.com
Mark.Harper@example.com
MelN@example.com
YZ41234253@example.com
Mark.Harper@example.com
BeckyJamzie@example.com
deVries1955@example.com
JasSingh78@example.com
JimmyColton@example.com
EthelsPlace@example.com

Coding Task: Note that there is an error in the "order type" column, where instead of "Individual" one row says "Ind.". Write code to loop though the column and change this. Don't just change that one example by setting the value directly - write code so that it will catch any instance of this. Use the example above as a starting point, but clearly you will have to make some changes to it.

In [122]:
for i,c in enumerate(customer_data["Order Type"]):
    if c == "Ind.":
        customer_data.at[i, "Order Type"] = "Individual"
        print("Cell " + str(i) + " changed from Ind. to Individual")

Cell 2 changed from Ind. to Individual

In [123]:
customer_data

,Customer Name,Address,Email,Total Orders,Order Type
0,Jaswinder Singh,"37 Broadwide Road, Rummidge, RU6 7HG",JasSingh78@example.com,57,Individual
1,Mark Harper,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,5,Packets
2,Melinda Nagy,"77 Melton Road, Somecity, SM12 1HE",MelN@example.com,152,Individual
3,Yichen Zhang,"6/1 Braeside Court, Scotstoun, SC5 1HE",YZ41234253@example.com,17,Packets
4,Mark Harper,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,5,Packets
5,Rebecca Jameson,"The Old Rectory, Humbleside, Marksham, MA14 6LW",BeckyJamzie@example.com,271,Individual
6,Willem deVries,"17 Parkside, Newtown-le-Willows, NL18 5TH",deVries1955@example.com,23,Packets
7,Jaswinder Singh,"37 Broadwide Road, Rummidge, South Midlands, R...",JasSingh78@example.com,72,Individual
8,James Colton,"19 Belton Street, Isle of Trees, IT2 5PQ",JimmyColton@example.com,6,Packets
9,Ethel Trellis,"1 The Avenue, Foxley Estate, Rummidge, RU4 7WF",EthelsPlace@example.com,2,Packets

Preliminary example: *iterrows()* is a function on a dataframe that we can use alongside a for loop to go through each of the items in a dataframe, giving us both the row number (often called the *index* of that line) and the data on the row itself. Here is an example, where we print out the data.

In [124]:
#example
for i1,c1 in customer_data.iterrows():
    print(i1)
    print(list(c1))

0
['Jaswinder Singh', '37 Broadwide Road, Rummidge, RU6 7HG', 'JasSingh78@example.com', 57, 'Individual']
1
['Mark Harper', 'Flat 5, Riverside House, Anytown, AN2 8NE', 'Mark.Harper@example.com', 5, 'Packets']
2
['Melinda Nagy', '77 Melton Road, Somecity, SM12 1HE', 'MelN@example.com', 152, 'Individual']
3
['Yichen Zhang', '6/1 Braeside Court, Scotstoun, SC5 1HE', 'YZ41234253@example.com', 17, 'Packets']
4
['Mark Harper', 'Flat 5, Riverside House, Anytown, AN2 8NE', 'Mark.Harper@example.com', 5, 'Packets']
5
['Rebecca Jameson', 'The Old Rectory, Humbleside, Marksham, MA14 6LW', 'BeckyJamzie@example.com', 271, 'Individual']
6
['Willem deVries', '17 Parkside, Newtown-le-Willows, NL18 5TH', 'deVries1955@example.com', 23, 'Packets']
7
['Jaswinder Singh', '37 Broadwide Road, Rummidge, South Midlands, RU6 7HG', 'JasSingh78@example.com', 72, 'Individual']
8
['James Colton', '19 Belton Street, Isle of Trees, IT2 5PQ', 'JimmyColton@example.com', 6, 'Packets']
9
['Ethel Trellis', '1 The Avenue, Foxley Estate, Rummidge, RU4 7WF', 'EthelsPlace@example.com', 2, 'Packets']

Coding Task: There is a duplicate entry. In the next block, write code to get rid of duplicate entries. Create an empty list, called *duplicates*, that will check  You will need to use two *for* loops, one inside the other, to loop around the customer entries. Then use an *if* statement to check whether the two customers are identical, and if so, store the line numbers in a list. Finally, use *customers.drop(1,inplace=True)* to delete row 1 of the duplicated rows (don't delete both!). Note that we have to say *inplace* otherwise the original dataframe will be unchanged and a copy returned. This is a rather complex task so please remember to ask us for help.

In [125]:
a = list(customer_data["Customer Name"])
seen = []

duplicate_list = [x for x in a if x in seen or seen.append(x)]

print(duplicate_list)

for item in duplicate_list:
    my_value = customer_data.loc[customer_data["Customer Name"]==item, "Total Orders"].sum()
    customer_data.at[customer_data["Customer Name"]==item, "Total Orders"] = my_value

customer_data.drop_duplicates(subset=['Customer Name'], inplace=True)

customer_data

['Mark Harper', 'Jaswinder Singh']

,Customer Name,Address,Email,Total Orders,Order Type
0,Jaswinder Singh,"37 Broadwide Road, Rummidge, RU6 7HG",JasSingh78@example.com,129,Individual
1,Mark Harper,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,10,Packets
2,Melinda Nagy,"77 Melton Road, Somecity, SM12 1HE",MelN@example.com,152,Individual
3,Yichen Zhang,"6/1 Braeside Court, Scotstoun, SC5 1HE",YZ41234253@example.com,17,Packets
5,Rebecca Jameson,"The Old Rectory, Humbleside, Marksham, MA14 6LW",BeckyJamzie@example.com,271,Individual
6,Willem deVries,"17 Parkside, Newtown-le-Willows, NL18 5TH",deVries1955@example.com,23,Packets
8,James Colton,"19 Belton Street, Isle of Trees, IT2 5PQ",JimmyColton@example.com,6,Packets
9,Ethel Trellis,"1 The Avenue, Foxley Estate, Rummidge, RU4 7WF",EthelsPlace@example.com,2,Packets

Let's re-set the index column so that there isn't a missing value, then let's print the customers dataframe to

In [126]:
customer_data.reset_index(inplace=True, drop=True)
customer_data

,Customer Name,Address,Email,Total Orders,Order Type
0,Jaswinder Singh,"37 Broadwide Road, Rummidge, RU6 7HG",JasSingh78@example.com,129,Individual
1,Mark Harper,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,10,Packets
2,Melinda Nagy,"77 Melton Road, Somecity, SM12 1HE",MelN@example.com,152,Individual
3,Yichen Zhang,"6/1 Braeside Court, Scotstoun, SC5 1HE",YZ41234253@example.com,17,Packets
4,Rebecca Jameson,"The Old Rectory, Humbleside, Marksham, MA14 6LW",BeckyJamzie@example.com,271,Individual
5,Willem deVries,"17 Parkside, Newtown-le-Willows, NL18 5TH",deVries1955@example.com,23,Packets
6,James Colton,"19 Belton Street, Isle of Trees, IT2 5PQ",JimmyColton@example.com,6,Packets
7,Ethel Trellis,"1 The Avenue, Foxley Estate, Rummidge, RU4 7WF",EthelsPlace@example.com,2,Packets

Thinking Task and (optional) Advanced Coding Task (optional): There is a more complex duplicated entry. If you look at the customer "Jaswinder Singh" then you will see that there are two similar entries - same name, similar address, same email, but different numbers of orders. What do you think should be done with this entry? I would suggest that it make sense to combine the two rows into one, and add the total number of orders together - this looks like the same customer has created two accounts. Do you agree? This demonstrates that deciding what to do about duplicate and near-duplicate entries isn't trivial - you need to think about the context of the data. If you are confident with coding, write some code in the next block to do this - this is rather challenging, though, so you might want to move on to the next task.

In [127]:
#ANSWER to optional task

Coding Task: Now let's start putting the data into the required format. Firstly, let's sort out the order totals. Remember that if people ordered in "Packets" then that is packets of twelve coffee pods, and that the final format requires "Total Orders" to be in terms of individual pods. So, write some code in the next block that loops through the rows, and if the "Order Type" is Packets, multiplies the "Order Total" column by 12. For consistency, you should then change the "Order Type" to Individual, though you could perhaps neglect this because we are going to delete the "Order Type" column soon because it is not needed in the final format.

In [128]:
#ANSWER
for i,c in enumerate(customer_data["Order Type"]):
    if c == "Packets":
        customer_data.at[i, "Order Type"] = "Individual"
        customer_data.at[i, "Total Orders"] = customer_data.at[i, "Total Orders"] * 12
        print("Cell " + str(i) + " changed from Packets to Individual")

Cell 1 changed from Packets to Individual
Cell 3 changed from Packets to Individual
Cell 5 changed from Packets to Individual
Cell 6 changed from Packets to Individual
Cell 7 changed from Packets to Individual

In [129]:
customer_data.drop(['Order Type'], axis = 1, inplace = True)
customer_data

,Customer Name,Address,Email,Total Orders
0,Jaswinder Singh,"37 Broadwide Road, Rummidge, RU6 7HG",JasSingh78@example.com,129
1,Mark Harper,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,120
2,Melinda Nagy,"77 Melton Road, Somecity, SM12 1HE",MelN@example.com,152
3,Yichen Zhang,"6/1 Braeside Court, Scotstoun, SC5 1HE",YZ41234253@example.com,204
4,Rebecca Jameson,"The Old Rectory, Humbleside, Marksham, MA14 6LW",BeckyJamzie@example.com,271
5,Willem deVries,"17 Parkside, Newtown-le-Willows, NL18 5TH",deVries1955@example.com,276
6,James Colton,"19 Belton Street, Isle of Trees, IT2 5PQ",JimmyColton@example.com,72
7,Ethel Trellis,"1 The Avenue, Foxley Estate, Rummidge, RU4 7WF",EthelsPlace@example.com,24

Coding Task: Read the documentation about the "drop" function at https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html and in the next block delete the "Order Type" column.

In [130]:
#ANSWER

Preliminary Example: In the next step, we are going to split the "name" column. You do this using the "split" function in python, https://www.w3schools.com/python/ref_string_split.asp Here is an example:

In [131]:
name = "Colin Johnson"
splitName = name.split()
print(splitName)

['Colin', 'Johnson']

Coding Task: Now, we need to create two new columns consisting of the first and last names (we are really lucky here, everyone in our data has just one first name and one last name, and they are clearly separated by a space. In real data, this is a much more complex task!). In the next block, write a *for* loop to go through the "Customer Name" column, and make a list of the first names and a list of the last names. Call these lists *firstNames* and *lastNames*.

In [132]:
customer_data

,Customer Name,Address,Email,Total Orders
0,Jaswinder Singh,"37 Broadwide Road, Rummidge, RU6 7HG",JasSingh78@example.com,129
1,Mark Harper,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,120
2,Melinda Nagy,"77 Melton Road, Somecity, SM12 1HE",MelN@example.com,152
3,Yichen Zhang,"6/1 Braeside Court, Scotstoun, SC5 1HE",YZ41234253@example.com,204
4,Rebecca Jameson,"The Old Rectory, Humbleside, Marksham, MA14 6LW",BeckyJamzie@example.com,271
5,Willem deVries,"17 Parkside, Newtown-le-Willows, NL18 5TH",deVries1955@example.com,276
6,James Colton,"19 Belton Street, Isle of Trees, IT2 5PQ",JimmyColton@example.com,72
7,Ethel Trellis,"1 The Avenue, Foxley Estate, Rummidge, RU4 7WF",EthelsPlace@example.com,24

In [133]:
for i,c in enumerate(customer_data["Customer Name"]):
    name = c.split()
    customer_data.at[i, "First Name"] = name[0]
    customer_data.at[i, "Last Name"] = name[1]
customer_data

,Customer Name,Address,Email,Total Orders,First Name,Last Name
0,Jaswinder Singh,"37 Broadwide Road, Rummidge, RU6 7HG",JasSingh78@example.com,129,Jaswinder,Singh
1,Mark Harper,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,120,Mark,Harper
2,Melinda Nagy,"77 Melton Road, Somecity, SM12 1HE",MelN@example.com,152,Melinda,Nagy
3,Yichen Zhang,"6/1 Braeside Court, Scotstoun, SC5 1HE",YZ41234253@example.com,204,Yichen,Zhang
4,Rebecca Jameson,"The Old Rectory, Humbleside, Marksham, MA14 6LW",BeckyJamzie@example.com,271,Rebecca,Jameson
5,Willem deVries,"17 Parkside, Newtown-le-Willows, NL18 5TH",deVries1955@example.com,276,Willem,deVries
6,James Colton,"19 Belton Street, Isle of Trees, IT2 5PQ",JimmyColton@example.com,72,James,Colton
7,Ethel Trellis,"1 The Avenue, Foxley Estate, Rummidge, RU4 7WF",EthelsPlace@example.com,24,Ethel,Trellis

In the next block, we add these new columns to the customers DataFrame.

In [ ]:
customers["First Name"] = firstNames
customers["Last Name"] = lastNames
print(customers)

Coding Task: In the next block, remove the original "Customer Name" column

In [134]:
customer_data.drop(['Customer Name'], axis = 1, inplace = True)
customer_data

,Address,Email,Total Orders,First Name,Last Name
0,"37 Broadwide Road, Rummidge, RU6 7HG",JasSingh78@example.com,129,Jaswinder,Singh
1,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,120,Mark,Harper
2,"77 Melton Road, Somecity, SM12 1HE",MelN@example.com,152,Melinda,Nagy
3,"6/1 Braeside Court, Scotstoun, SC5 1HE",YZ41234253@example.com,204,Yichen,Zhang
4,"The Old Rectory, Humbleside, Marksham, MA14 6LW",BeckyJamzie@example.com,271,Rebecca,Jameson
5,"17 Parkside, Newtown-le-Willows, NL18 5TH",deVries1955@example.com,276,Willem,deVries
6,"19 Belton Street, Isle of Trees, IT2 5PQ",JimmyColton@example.com,72,James,Colton
7,"1 The Avenue, Foxley Estate, Rummidge, RU4 7WF",EthelsPlace@example.com,24,Ethel,Trellis

Coding Task: Next, we need to re-order the columns. This is done using the *reindex* method on a dataframe. This takes a list of the column titles in the order that we want to put them in. In the next block, create a list called *newOrder* with the columns titles in the right order, using the "Background Information: Interface Format" section at the beginning of this sheet to find out what these are. Then the next block will apply the reindex method.

In [138]:
cols = customer_data.columns.tolist()
cols = cols[-2:] + cols[:-2]
customer_data = customer_data[cols]

In [139]:
customer_data

,First Name,Last Name,Address,Email,Total Orders
0,Jaswinder,Singh,"37 Broadwide Road, Rummidge, RU6 7HG",JasSingh78@example.com,129
1,Mark,Harper,"Flat 5, Riverside House, Anytown, AN2 8NE",Mark.Harper@example.com,120
2,Melinda,Nagy,"77 Melton Road, Somecity, SM12 1HE",MelN@example.com,152
3,Yichen,Zhang,"6/1 Braeside Court, Scotstoun, SC5 1HE",YZ41234253@example.com,204
4,Rebecca,Jameson,"The Old Rectory, Humbleside, Marksham, MA14 6LW",BeckyJamzie@example.com,271
5,Willem,deVries,"17 Parkside, Newtown-le-Willows, NL18 5TH",deVries1955@example.com,276
6,James,Colton,"19 Belton Street, Isle of Trees, IT2 5PQ",JimmyColton@example.com,72
7,Ethel,Trellis,"1 The Avenue, Foxley Estate, Rummidge, RU4 7WF",EthelsPlace@example.com,24

In [ ]:
customers = customers.reindex(columns=newOrder)
print(customers)

Coding task Okay, the final part of the project is to write this to a csv file. Look at https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html to find out how to do this, and write a line of code in the next block to do this. Make sure to use the "index=False" option so that you do not include a numerical index column.

In [140]:
customer_data.to_csv("preprocessed_customer_data.csv")

We are finished here. Look in the folder to check that the csv file has been correctly written, and then go back to the command line to upload the csv file to the GitHub project.